# tab sources
tap "homebrew/cask-drivers"
tap "homebrew/homebrew-cask-versions"
tap "lencx/chatgpt"

# CLI Tools
brew "ansible"
brew "git"
brew "go"
brew "helm"
brew "helm"
brew "mas"
brew "node"
brew "pnpm"
brew "pre-commit"
brew "ssh-copy-id"
brew "whalebrew"
brew "yarn"
brew "yq"

# Apps
cask "1password"
cask "1password-cli"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "autodesk-fusion360"
cask "bambu-studio"
cask "chatgpt", args: { "no-quarantine": true }
cask "docker"
cask "firefox"
cask "google-chrome"
cask "home-assistant"
cask "intellij-idea"
cask "iterm2"
cask "keka"
cask "microsoft-office"
cask "microsoft-teams"
cask "obs"
cask "orcaslicer", args: { "no-quarantine": true }
cask "parallels17"
cask "pingid"
cask "postman"
cask "sourcetree"
cask "spotify"
cask "tor-browser"
cask "visual-studio-code"
cask "vlc"
cask "warp"

# Drivers
cask "elgato-stream-deck"
cask "elgato-wave-link"
cask "synology-drive"
cask "synology-surveillance-station-client"

# AppStore Apps
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "AutoMounter", id: 1160435653
mas "Final Cut Pro", id: 424389933
mas "Folder Peek", id: 1615988943
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pure Paste", id: 1611378436
mas "Things", id: 904280696
mas "Xcode", id: 497799835
